Revit 2025 API
LightType Class
 This class encapsulates light information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightType
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class LightType : IDisposable
Public Class LightType
	Implements IDisposable
public ref class LightType : IDisposable
type LightType =
    class
        interface IDisposable
    end
The LightType type exposes the following members.
Properties
Name | Description
ColorFilter |  The light filter color.
DimmingColor |  The dimming temperature value in Kelvins.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LightType
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetInitialColor |  Return a copy of an object derived from InitialColor
GetInitialIntensity |  Return a copy of an object derived from InitialIntensity
GetLightDistribution |  Return a copy of an object derived from LightDistribution
GetLightShape |  Return a copy of an object derived from LightShape
GetLightType |  Creates a light type object from the given document and family type ID
GetLightTypeFromInstance |  Creates a light type object from the given document and element ID
GetLossFactor |  Return a copy of an object derived from LossFactor
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetInitialColor |  Replace the current initial color object with the given object
SetInitialIntensity |  Replace the current initial intensity object with the given object
SetLightDistribution |  Replace the current LightDistribution object with the given object
SetLightShape |  Replace the current LightShape object with the given object
SetLossFactor |  Replace the current loss factor object with the given object
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Example
public void GetLightData(Document document)
{
    // This code demonstrates how to get light information from project and family document
    LightType lightData = null;
    if (document.IsFamilyDocument)
    {
        // In family document, get LightType via LightFamily.GetLightType(int) method.
        LightFamily lightFamily = LightFamily.GetLightFamily(document);
        for (int index = 0; index < lightFamily.GetNumberOfLightTypes(); index++)
        {
            lightData = lightFamily.GetLightType(index);
        }
    }
    else
    {
        // In family document, get LightType via GetLightTypeFromInstance or GetLightType method.
        // In order to get the light information, please get a light fixture instance first
        FilteredElementCollector collector = new FilteredElementCollector(document);
        collector.OfClass(typeof(FamilyInstance)).OfCategory(BuiltInCategory.OST_LightingFixtures);
        FamilyInstance lightFixture = collector.Cast<FamilyInstance>().First<FamilyInstance>();
        if (lightFixture == null)    // check null reference
            return;
        // Get the LightType for given light fixture
        lightData = LightType.GetLightTypeFromInstance(document, lightFixture.Id);
    }
    // Get the light data via LightType
    Color filterColor = lightData.ColorFilter;  // get the ColorFilter property
    LossFactor lossFactor = lightData.GetLossFactor();  // get the loss factor
    if (lossFactor is AdvancedLossFactor)
    {
        AdvancedLossFactor advancedFactor = lossFactor as AdvancedLossFactor;
        double luminaireValue = advancedFactor.LuminaireDirtDepreciation;
    }
}
Public Sub GetLightData(document As Document)
   ' This code demonstrates how to get light information from project and family document
   Dim lightData As LightType = Nothing
   If document.IsFamilyDocument Then
      ' In family document, get LightType via LightFamily.GetLightType(int) method.
      Dim lightFamily__1 As LightFamily = LightFamily.GetLightFamily(document)
      For index As Integer = 0 To lightFamily__1.GetNumberOfLightTypes() - 1
         lightData = lightFamily__1.GetLightType(index)
      Next
   Else
      ' In family document, get LightType via GetLightTypeFromInstance or GetLightType method.
      ' In order to get the light information, please get a light fixture instance first
      Dim collector As New FilteredElementCollector(document)
      collector.OfClass(GetType(FamilyInstance)).OfCategory(BuiltInCategory.OST_LightingFixtures)
      Dim lightFixture As FamilyInstance = collector.Cast(Of FamilyInstance)().First()
      If lightFixture Is Nothing Then
         ' check null reference
         Return
      End If
      ' Get the LightType for given light fixture
      lightData = LightType.GetLightTypeFromInstance(document, lightFixture.Id)
   End If
   ' Get the light data via LightType
   Dim filterColor As Color = lightData.ColorFilter
   ' get the ColorFilter property
   Dim lossFactor As LossFactor = lightData.GetLossFactor()
   ' get the loss factor
   If TypeOf lossFactor Is AdvancedLossFactor Then
      Dim advancedFactor As AdvancedLossFactor = TryCast(lossFactor, AdvancedLossFactor)
      Dim luminaireValue As Double = advancedFactor.LuminaireDirtDepreciation
   End If
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace